local _,ns = ...

local LostAndFound =  {
	[807] = { --四风
		[86218] = {
			["desc"] = "竹子丛里。非武僧职业可以获得的唯一武僧风格法杖。",
			["coord"] = {
				19013800, -- [1]
				17723542, -- [2]
				18964268, -- [3]
				15452956, -- [4]
				14903416, -- [5]
			},
		},
		[87524] = {
			["desc"] = "*不触发成就",
			["coord"] = 92153889, 
		},
		[86565] = {
			["desc"] = "黑蹄",
			["coord"] = {
				35396078, -- [1]
				31856130, -- [2]
				38595790, -- [3]
			},
		},
		[86079] = {
			["coord"] = 45403802, 
		},
		[86576] = {
			["desc"] = "撕裂者纳拉克",
			["coord"] = {
				9554611, -- [1]
				12125187, -- [2]
				12285894, -- [3]
				8756392, -- [4]
			},
		},
		[86587] = {
			["desc"] = "納斯拉·斑皮",
			["coord"] =88821809, -- [1]
		},
		[86591] = {
			["desc"] = "波罗波斯",
			["coord"] = 13723878, -- [1]
		},
		[86580] = {
			["desc"] = "塞勒纳",
			["coord"] = {
				58174192, -- [1]
				55932752, -- [2]
				56573616, -- [3]
			},
		},
		["一箱被偷的货物"] = {
			["desc"] = "在汇风岭的兔子洞里，宝箱，随机附魔项链",
			["icon"] = 9,
			["coord"] =43953808, -- [1]

		},
		[86583] = {
			["desc"] ="萨尔因作战斥候+",
			["coord"] = {
				68285318, -- [1]
				68286287, -- [2]
				72295842, -- [3]
				74385318, -- [4]
			},
		},
		[85973] = {
			["coord"] = 46642476, -- [1]
		},
		[86569] = {
			["desc"] = "苏里克夏",
			["coord"] =36832647, -- [1]
		},
		[86572]= {
			["desc"] = "虬达",
			["coord"] =18547570, -- [1]
		},
		["[ 兔妖宝箱 ]"] = {
			["desc"] = "(23.72,28.32)入口隐藏在灌木丛中。*不触发成就",
			["icon"] = 28,
			["coord"] =23253067, -- [1]
		},
	},
	[809] = { --崑莱
		[86573] = {
			["desc"] ="哈瓦克" ,
			["coord"] =57687348, -- [1]
		},
		["失窃的林精宝箱"] = {
			["desc"] = "凛风洞深处(坐标：31.9 50.4)  *不触发成就",
			["icon"] = 28,
			["coord"] =59005300, --洞口
		},
		["遗失的冒险者的遗产   墨墨的宝箱"] = {
			["desc"] = "寇塔峰靠近城墙的废弃营地 (随机位置刷新...参考坐标：47.9 73.5) *由玩家提供的位置  100金 *不触发成就     断齿哨站任务怪莫莫背后(坐标：47.9 73.5) *由玩家提供的位置",
			["icon"] = 28,
			["coord"] =48127329, -- [1]
		},
		[86427] = { --修复
			["desc"] = "*不触发成就",
			["coord"] =57807630, -- [1]
		},
		[86422] = {
			["desc"] = "*不触发成就",
			["icon"] = 28,
			["coord"] =72063388, -- [1]
		},
		[86125] = {
			["desc"] = "洞穴最深处,与冰块中的npc64227冰封小径运货人对话获得。",
			["icon"] = 9,
			["coord"] =37507800, -- [1]
		},
		[86471] = {
			["desc"] = "*不触发成就",
			["icon"] = 28,
			["coord"] =64264516, -- [1]
		},
		[86566] = {
			["desc"] = "考达多罗斯",
			["coord"] =48988009, -- [1]
		},
		[86430] = {
			["desc"] = "*不触发成就",
			["icon"] = 28,
			["coord"] =52525126, -- [1]
		},
		[86393] = {
			["desc"] = "不息山的顶峰的云壬的石像边。特效类似于[萨格拉斯的诅咒视界]。",
			["coord"] =44495273, -- [1]
		},
		[86222] = {--"林精的衣箱"
			["desc"] = "凛风洞深处，随机附魔披风，56.3 71.5",
			["icon"] = 28,
			["coord"] =72007300, -- [1]
		},
		[88723] = {
			["desc"] = "武器架上。",
			["coord"] ={70006380,7120626}, -- [1]
		},
		[86592] = {
			["desc"] = "斯克里奇",
			["coord"] = {
				44966426, -- [1]
				47556472, -- [2]
				46276198, -- [3]
			},
		},
		[86588] = {
			["desc"] = "漫游者阿波尼+",
			["coord"] =40604210, -- [1]
		},
		[86394] = {
			["desc"] = "深石窟，入口52.8 71.3，在洞里第二层，在底层水池中的大石头上。特殊模型。",
			["icon"] = 9,
			["coord"] =51497403, -- [1]
		},
		[86577] = {
			["desc"] ="斯基提克" ,
			["coord"] =37788072, -- [1]
		},
		[86570] = {
			["desc"] = "波尔金黑拳",
			["coord"] =57534806, -- [1]
		},
		[86584] = {
			["desc"] = "预言者奈松+",
			["coord"] =64631346, -- [1]
		},
		["猢狲宝箱"] = {
			["desc"] = "肘锤洞任务怪[邪恶的]裘裘背后 100金 *不触发成就",
			["icon"] = 28,
			["coord"] =50212528, -- [1]
		},
		[86581] = {
			["desc"] = "被放逐的诺拉克斯",
			["coord"] =73827716, -- [1]
		},
	},
	[811] = { --恒春谷
		[86586] = {
			["desc"] = "独眼者摩多",
			["coord"] = {
				39685349, -- [1]
				44114878, -- [2]
				36355946, -- [3]
			},
		},
		[86590] = {
			["desc"] = "迅云艾然",
			["coord"] =41347050, -- [1]
		},
		[86594] = {
			["desc"] ="纳纳斯少校",
			["coord"] =34699203, -- [1]
		},
		[86568] = {
			["desc"] = "利眼约里克",
			["coord"] =86644286, -- [1]
		},
		[86579] = {
			["desc"] = "凋零的卡尔提克",
			["coord"] =14175819, -- [1]
		},
		[86571] = {
			["desc"] = "灵魂窃贼康格",
			["coord"] =14843359, -- [1]
		},
		[86575] = {
			["desc"] ="乌戈拉克斯" ,
			["coord"] =42322402, -- [1]
		},
		[86582] = {
			["desc"] = "撒罕潮猎者",
			["coord"] =61745584, -- [1]
		},
	},
	[858] = { --悚然
		[86523] = {
			["desc"] = "闷水壶的冒险码头，海底2个岩石之间的海草上。卡拉克西风格模型",
			["coord"] =56997849, -- [1]
		},
		[86519] = {
			["desc"] = "一根底部覆盖着紫色灌木的柱子，比其他的柱子都高。卡拉克西风格模型",
			["coord"] =71883596, -- [1]
		},
		[86526] = {
			["desc"] = "暮根沼泽，在沼泽内的一小圈干地，附近有些石头和骨头。",
			["coord"] =54325685, -- [1]
		},
		[86524] = {
			["desc"] = "扎尼维斯的白色的岩石，在那个根部。特殊模型。",
			["coord"] =30299083, -- [1]
		},
		[86589] = {
			["desc"] = "艾利天镜+",
			["coord"] =33812301, -- [1]
		},
		[86522] = {
			["desc"] = "贴在南部洞窟的墙壁上。卡拉克西风格模型",
			["coord"] =66916409, -- [1]
		},
		[86578] = {
			["desc"] ="嘎洛克+" ,
			["coord"] =38202888, -- [1]
		},
		[86529] = {
			["desc"] = "绿名海螺npc65552“拉帕纳微光海螺”对话获得",
			["coord"] =42076305, -- [1]
		},
		[86564] = {
			["desc"] = "黑化者卡尔+",
			["coord"] =71633742, -- [1]
		},
		[86567] = {
			["desc"] ="破坏者哒克" ,
			["coord"] =24822834, -- [1]
		},
		[86585] = {
			["desc"] ="奥米斯格林洛克" ,
			["coord"] = {
				41055971, -- [1]
				38486177, -- [2]
				35246261, -- [3]
				38115846, -- [4]
				36816701, -- [5]
			},
		},
		[86574] = {
			["desc"] = "“利刃”科罗尔+",
			["coord"] =73542277, -- [1]
		},
		[86527] = {
			["desc"] = "毒水崖 琥珀孵育室门口，藏在灌木丛中比较难发现，",
			["coord"] =28894218, -- [1]
		},
		[86593] = {
			["desc"] = "聪明的伊克伊克+ 树洞里。",
			["coord"] =54656652, -- [1]
		},
		[86563] = {
			["desc"] = "纳拉什沃登提斯",
			["coord"] =64745765, -- [1]
		},
		[86521] = {
			["desc"] = "恐惧之心西北，靠近水边的三个石头中间。",
			["coord"] =32563139, -- [1]
		},
		[86525] = {
			["desc"] = "泥鳞窟，水下洞穴，任务怪背后。",
			["coord"] =26205041, -- [1]
		},
		[86520] = {
			["desc"] = "找到这样一棵树，附近有3个螳螂人在控制一个巨虫。卡拉克西风格模型。",
			["coord"] =49063030, -- [1]
		},
	},
	[806] = { --翠玉
		[85780] = {
			["icon"] = 28,
			["coord"] =26293181, -- [1]
		},
		[86216] = {
			["desc"] = "努卡努卡营地西北边,玉盘湖中央。",
			["icon"] = 28,
			["coord"] =23595108, -- [1]
		},
		[87780] = {
			["desc"] ="马尔泰弱智",
			["coord"] =56013099, -- [1]
		},
		[86199] = {
			["desc"] = "npc64272。玉婆婆前青玉战士雕像(坐标：39.2,46.6)。模型类似[流光碧空之歌]",
			["coord"] =39244641, -- [1]
		},
		["神龛"] = {
			["desc"] = "被斥责 *不触发成就",
			["coord"] =46408070, -- [1]
		},
		[90078] = {
			["desc"] = "罗布·悲鸣",
			["icon"] = 28,
			["coord"] =28162155, -- [1]
		},
		["船载储物箱"] = {
			["desc"] = "翡翠林地图边缘 (坐标：51.4 100.0)  沉没在南部海岸的联盟船只造成的*不触发成就",
			["icon"] = 28,
			["coord"] =51429998, -- [1]
		},
		[85777] = {
			["desc"] = "矿洞入口和内部都可能刷新。",
			["icon"] = 9,
			["coord"] =46262952, -- [1]
		},
		[85781] = {
			["desc"] = "在铁腕机坪边上的一口井里。",
			["coord"] =30982700, -- [1]
		},
		[86196] = {
			["desc"] = "神龙之心南，说是在河里",
			["coord"] = {
				45306479, -- [1]
				47016757, -- [2]
				45997160, -- [3]
			},
		},
		["秘藏的宝藏"] = {
			["desc"] = "临风岛山洞(坐标：64 ,25)",
			["icon"] = 28,
			["coord"] =64042510, -- [1]
		},
		[86198] = {
			["desc"] = "十雷台的唤魂者之座。特殊模型",
			["coord"] = {
				42971159, -- [1]
				41251789, -- [2]
				39871430, -- [3]
			},
		},
		[85776] = {
			["desc"] = "欧文的许愿井，十雷台西北边。卡拉克西风格模型",
			["coord"] =39360725, -- [1]
		},
	},
	[857] = { --蛮荒
		[87266] = {
			["desc"] = "刷新稀有猴子的船头。",
			["coord"] =52318844, -- [1]
		},
		[86220] = {
			["desc"] = "朱家堡西边山洞(坐标：75.1 55.1) *由玩家提供的位置 100金 *不触发成就",
			["icon"] = 28,
			["coord"] =71180862, -- [1]
		},
		[86124] = {
			["desc"] = "站在海滩面朝大海的熊猫人npc德明大叔，就在他屁股后地面插着。简易鱼竿模型",
			["coord"] =50744919, -- [1]
		},
		["装备箱+"] = {
			["desc"] = "船舱底层，宝箱，随机附魔鞋子",
			["coord"] =41949262, -- [1]
		},
	},
	[810] = { --螳螂
		["一箱被丢弃的货物*"] = {
			["desc"] = "蟠龙脊内燃烧的帐篷 (坐标：62.8 34.0)",
			["coord"] =62743440, -- [1]
		},
		[86517] = {
			["desc"] = " 科里维斯根部 (坐标：50.8 55.1)",
			["icon"] = 28,
			["coord"] =50795511, -- [1]
		},
		[86472] = {
			["desc"] = "黯光枯木树根下(坐标：65.8 86.0) *不触发成就",
			["icon"] = 28,
			["coord"] =65038601, -- [1]
		},
		[86518] = {
			["desc"] = " 奥苏尔火营，稀有精英隆恩附近的火盆.",
			["coord"] =65944464, -- [1]
		},
		[86516] = {
			["desc"] = "砮皂寺西边的山洞 (坐标：48.4 89.2)",
			["icon"] = 28,
			["coord"] =33626230, -- [1]
		},
	},
	[873] = { --客栈
		["被遗忘的密码箱"] = {
			["desc"] = "客栈二楼 10金 *不触发成就",
			["icon"] = 28,
			["coord"] =55377114, -- [1]
		},
		[86473] = {
			["desc"] = "石匠之愚山顶，黑市的东南边 *不触发成就",
			["coord"] =75247634, -- [1]
		},
	},
	["PrankstersHollow"] = {
		["林精的衣箱"] = {
			redir = 809,--引用809这张图的同名称物品信息
			coord = 54006900,
		},
	},
}

local npc = {}
for i = 1,7 do
	npc[i] = GetAchievementCriteriaInfo(6606,i)
end
local icon1 = { icon = select(10, GetAchievementInfo(6620))}
local icon2 = { icon = select(10, GetAchievementInfo(7936))}
local PetTamers = {
	[807] = {
		[npc[2]] = {
		coord = 46004360,
		desc = "2元素奶妈+野兽遁地 ->水系爆发+机械",
		icon = icon1,
		},
	},
	[809] = {
		[npc[4]] = {
			coord = 35807360,
			desc = "飞行兔子多段攻击+山羊 ->格挡+机械",
			icon = icon1,
		},
		["土灵"] = {
			coord = 64809360,
			desc = "高速兔1v2",
			icon = icon2,
		},
	},
	[811] = {
		[npc[7]] = {
			coord = 67604080,
			desc = "闪电天气龙+多段蚂蚱 ->强力格挡",
			icon = icon1,
		},
	},
	[858] = {
		[npc[6]] = {
			coord = 55003760,
			desc = "",
			icon = icon1,
		},
		["水灵"] = {
			coord = 61208760,
			desc = "",
			icon = icon2,
		},
	},
	[806] = {--翠玉
		[npc[1]] = {
			coord = 48005400,
			desc = "",
			icon = icon1,
		},
		["风灵"] = {
			coord = 28803600,
			desc = "",
			icon = icon2,
		},
	},
	[857] = {--蛮荒
		[npc[3]] = {
			coord = 62204580,
			desc = "",
			icon = icon1,
		},
	},
	[810] = {--螳螂
		[npc[5]] = {
			coord = 36205220,
			desc = "",
			icon = icon1,
		},
		["火灵"] = {
			coord = 57004220,
			desc = "",
			icon = icon2,
		},
	},
}

local mt = {
	__add = function(a,b)
		for mapid,t1 in pairs(b) do
			if not a[mapid] then  --直接复制
				a[mapid] = t1
			else --合并
				for name,t2 in pairs(t1) do
					a[mapid][name] = t2
				end
			end
		end
		return a
	end}

setmetatable(LostAndFound,mt)
setmetatable(PetTamers,mt)

ns.db = LostAndFound + PetTamers

-- ns.db = {
	-- [mapid] = {
		-- [itemid] = {
			-- [coord] = {12345678, 23456789},--如果坐标唯一可以[coord] = 12345678,
			-- icon = texture,
			-- redir = mapname,--该坐标是其他地图的补充
			-- desc = "",--额外信息
		-- },
	-- },
-- }

--mapid 可以是地图唯一id也可以是名称 注意:山洞里必需使用名称 区域地图推荐mapid
--itemid 装备id 或者名称 如果是id直接调用物品图标